Конфигурация/Documents/Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Оплата</Name>
			<BasedOn>
				<xr:Item>Document.Сделка</xr:Item>
				<xr:Item>Document.СделкаРЕПО</xr:Item>
				<xr:Item>Document.ПогашениеЦеннойБумаги</xr:Item>
				<xr:Item>Document.НачислениеДивидендов</xr:Item>
				<xr:Item>Document.ПогашениеКупона</xr:Item>
				<xr:Item>Document.НачислениеЗадолженности</xr:Item>
				<xr:Item>Document.СделкаСВалютой</xr:Item>
				<xr:Item>Document.ВводЦенныхБумаг</xr:Item>
				<xr:Item>Document.ЗакрытиеКредитногоИнструмента</xr:Item>
				<xr:Item>Document.Маржа</xr:Item>
				<xr:Item>Document.ОтменаСделки</xr:Item>
				<xr:Item>Document.РешениеОбИзмененииУставногоКапиталаООО</xr:Item>
				<xr:Item>Document.ПриходПроцентовПоКредитномуИнструменту</xr:Item>
				<xr:Item>Document.РаспределениеДоходаПайщикам</xr:Item>
				<xr:Item>Document.ПоручениеНаДвижениеДенежныхСредств</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.РезервыПИФ</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствамПоПоручениям</xr:Item>
				<xr:Item>AccumulationRegister.РезервыПредстоящихРасходов</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПС</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКупленныеПоРЕПО</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.ПлановыеДатыОплат</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбеспечительныйПлатеж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчетЕПС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Единый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлановогоПогашенияЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>25</v8:Digits>
									<v8:FractionDigits>20</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СобственныйКурсОплаты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплатыКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияСделокРЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияСделокРЕПО</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВторойЧастиРЕПО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СобственныйКурсОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсОплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПроцент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежноеУсловиеСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Comment>Заполняется автоматически на основании части РЕПО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложенноеИсполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаздельноеИсполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СделкаРЕПО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСделкиРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/Оплата/Ext/ManagerModule.bsl
Функция ЗначенияЗаполнения() Экспорт
	
	ЗначенияЗаполнения = Новый Структура();
	ЗначенияЗаполнения.Вставить("МестоХранения", Справочники.МестаХранения.ВнебиржевойРынок);
	ЗначенияЗаполнения.Вставить("ВидДвижения",   Перечисления.ВидыДвижений.Расход);
	
	Возврат ЗначенияЗаполнения;
	
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	Если (Данные.ВидДвижения  = Перечисления.ВидыДвижений.Приход  
			ИЛИ Данные.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоАренде 
				И Данные.ВидДвижения = Перечисления.ВидыДвижений.Расход ) 
		И ЭтоОплатаНаОснованииОплаты(Данные.Ссылка) Тогда
		Если Данные.ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.НДФЛ) Тогда		
			Представление = "Возврат НДФЛ " + Данные.Номер + " от " + Данные.Дата;
		Иначе	
			Представление = "Возврат аванса " + НРег(Данные.ВидЗадолженности.Наименование) + " " + Данные.Номер + " от " + Данные.Дата;
		КонецЕсли;	
	ИначеЕсли Данные.ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.НДФЛ) Тогда		
		Представление = "Оплата по НДФЛ " + Данные.Номер + " от " + Данные.Дата;
	Иначе
		Представление = ?(Данные.Аванс, "Аванс ", "Оплата ") + НРег(Данные.ВидЗадолженности.Наименование) + " " + Данные.Номер + " от " + Данные.Дата;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("ВидЗадолженности");
	Поля.Добавить("Аванс");
	Поля.Добавить("Ссылка");
	Поля.Добавить("ВидДвижения");
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

Процедура ЗаполнитьДанныеКонтрагента(ДанныеОбъекта, СтрокаОснования) Экспорт
	
	Если ЗначениеЗаполнено(ДанныеОбъекта.Контрагент) Тогда
		Возврат;
	КонецЕсли; 
	
	Если ДанныеОбъекта.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии Тогда
		ДанныеОбъекта.Контрагент = ДанныеОбъекта.Брокер.ЮрФизЛицо;
		
	Иначе
		ТипОснования = ТипЗнч(СтрокаОснования.Основание);
		
		Если ТипОснования = Тип("ДокументСсылка.Сделка") Или ТипОснования = Тип("ДокументСсылка.СделкаРЕПО")
			Или ТипОснования = Тип("ДокументСсылка.ИзменениеУсловийСделки")
		Тогда
			ДанныеОбъекта.Контрагент               = СтрокаОснования.Основание.Контрагент;
			ДанныеОбъекта.РасчетныйСчетКонтрагента = СтрокаОснования.Основание.РасчетныйСчетКонтрагента;
			
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.НачислениеЗадолженности") Тогда
			ДанныеОбъекта.Контрагент = СтрокаОснования.Основание.Контрагент;
			
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПогашениеКупона") Тогда
			ДанныеОбъекта.Контрагент = СтрокаОснования.Основание.Облигация.Эмитент.ЮрФизЛицо;
			
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПогашениеЦеннойБумаги") Тогда
			Если СтрокаОснования.Основание.Рынок = Перечисления.РынкиЦенныхБумаг.Паи Тогда
				УправляющаяКомпания = Справочники.УправляющиеКомпании.ПолучитьУправляющуюКомпаниюПИФДляПаяНаДату(ДанныеОбъекта.Дата, СтрокаОснования.Основание.ЦеннаяБумага);
				ДанныеОбъекта.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УправляющаяКомпания, "ЮрФизЛицо");
			Иначе
				ДанныеОбъекта.Контрагент = СтрокаОснования.Основание.ЦеннаяБумага.Эмитент.ЮрФизЛицо;
			КонецЕсли;
			
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.НачислениеДивидендов") Тогда
			Если ТипЗнч(СтрокаОснования.Основание.ЦеннаяБумага) = Тип("СправочникСсылка.Паи") Тогда
				УправляющаяКомпания = Справочники.УправляющиеКомпании.ПолучитьУправляющуюКомпаниюПИФДляПаяНаДату(ДанныеОбъекта.Дата, СтрокаОснования.Основание.ЦеннаяБумага);
				ДанныеОбъекта.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УправляющаяКомпания, "ЮрФизЛицо");
			Иначе	
				ДанныеОбъекта.Контрагент = СтрокаОснования.Основание.ЦеннаяБумага.Эмитент.ЮрФизЛицо;
			КонецЕсли; 
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДатуИВалютуОплатыПоПервойСтрокеОснования(ДанныеОбъекта) Экспорт
	
	Если ДанныеОбъекта.Основания.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаОснования = ДанныеОбъекта.Основания[0];
	
	ТипОснования = ТипЗнч(СтрокаОснования.Основание);
	
	Если ТипОснования = Тип("ДокументСсылка.Сделка") Или ТипОснования = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	УсловияСделокРЕПОСрезПоследних.ВалютаОплаты,
			|	УсловияСделокРЕПОСрезПоследних.ДатаОплаты
			|ИЗ
			|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
			|			,
			|			НЕ Отменено
			|				И СделкаРЕПО = &Сделка
			|				И ЧастьСделкиРЕПО = &ЧастьСделкиРЕПО) КАК УсловияСделокРЕПОСрезПоследних";
			
		Если ТипОснования = Тип("ДокументСсылка.Сделка") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЧастьСделкиРЕПО = &ЧастьСделкиРЕПО", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "РЕПО", "");
		КонецЕсли;
			
		Запрос.УстановитьПараметр("Сделка",          СтрокаОснования.Основание);
		Запрос.УстановитьПараметр("ЧастьСделкиРЕПО", РаботаСЗадолженностямиКлиентСерверПовтИсп.ПолучитьЧастьСделкиРЕПОПоВидуЗадолженности(ДанныеОбъекта.ВидЗадолженности));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ДанныеОбъекта.ВалютаОплаты	 = Выборка.ВалютаОплаты;
			ДанныеОбъекта.Дата			 = РаботаСДокументами.ПолучитьВремяДокумента(Выборка.ДатаОплаты, ДанныеОбъекта.Ссылка);
		КонецЕсли;
		
	Иначе
		ДанныеОбъекта.ВалютаОплаты = СтрокаОснования.Валюта;
		
		Если  ТипОснования = Тип("ДокументСсылка.СделкаСВалютой") Тогда
			ЗаполнитьРасчетныйСчетПоСделкеСВалютой(ДанныеОбъекта);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРасчетныйСчетПоСделкеСВалютой(ДанныеОбъекта) Экспорт
	
	Если ДанныеОбъекта.Основания.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаОснования = ДанныеОбъекта.Основания[0];
	
	ТипОснования = ТипЗнч(СтрокаОснования.Основание);
	
	Если  ТипОснования = Тип("ДокументСсылка.СделкаСВалютой") Тогда
		
		//ДанныеОбъекта.Дата = СтрокаОснования.Основание.ДатаЗачисления;
		
		// расход по комиссии при продаже с расчетного счета получателя
		ЭтоБанковскаяКомиссия = (ДанныеОбъекта.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоБанковскойКомиссии 
								ИЛИ ДанныеОбъекта.ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.БанковскаяКомиссия));
		
		Если (ДанныеОбъекта.ВидДвижения = Перечисления.ВидыДвижений.Расход и СтрокаОснования.Основание.ВидСделки = Перечисления.ВидыСделок.Покупка) 
		 Или (ДанныеОбъекта.ВидДвижения = Перечисления.ВидыДвижений.Приход и СтрокаОснования.Основание.ВидСделки = Перечисления.ВидыСделок.Продажа)							
		 Или (СтрокаОснования.Основание.ВидСделки = Перечисления.ВидыСделок.Продажа И ЭтоБанковскаяКомиссия) Тогда
			ДанныеОбъекта.РасчетныйСчет = СтрокаОснования.Основание.РасчетныйСчетКонтрвалюты;	
		Иначе
			ДанныеОбъекта.РасчетныйСчет = СтрокаОснования.Основание.РасчетныйСчет;	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#Область СлужебныйПрограммныйИнтерфейс

// Необходимость проверки реквизита "Договор".
//
// Параметры:
//	ЭтотОбъект - ДокументОбъект.Оплата, ДанныеФормыСтруктура - объект документа
//
// Возвращаемое значение:
//	Булево - признак необходимости проверки реквизита
Функция НеобходимостьПроверкиРеквизитаДоговор(ЭтотОбъект) Экспорт
	Возврат ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления)
		И ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР;
КонецФункции

Функция ФормироватьДвиженияПоЗадолженностиПоДенежнымСредствамПоПоручениям(Документ) Экспорт
	
	Возврат Документ.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет 
		И (Документ.МестоХранения = ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок"))
		И (Документ.ВидДвижения = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Расход"))
		И Не ЗначениеЗаполнено(Документ.Брокер)
		И РаботаСдокументами.ДействуетКонтрольПорученийВнутреннейСистемы(?(ЗначениеЗаполнено(Документ.Дата), Документ.Дата, ТекущаяДата()), Документ.Организация) 
		И Справочники.ВидыЗадолженности.ЭтоВидЗадолженностиДляФормированияПоручений(Документ.ВидЗадолженности); 
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоОплатаНаОснованииОплаты(Оплата)
	
	// раньше было Данные.Ссылка.Основания.Количество() > 0) и (ТипЗнч(Данные.Ссылка.Основания[0].Основание) = Тип("ДокументСсылка.Оплата"),
	// однако это приводило к регистрации ошибки доступа к данным + сама концепция получения реквизитов через точку некорректна
	
	// #ТехДолг: по задаче #283142 необходимо отказаться от обращения к реквизитам через точку (запросом) при получении представления
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОплатаОснования.Основание КАК Основание
		|ИЗ
		|	Документ.Оплата.Основания КАК ОплатаОснования
		|ГДЕ
		|	ОплатаОснования.Ссылка = &Ссылка
		|	И ОплатаОснования.НомерСтроки = 1
		|	И (ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.Оплата)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.КорректировкаЗадолженности))";
	
	Запрос.УстановитьПараметр("Ссылка", Оплата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции 

#КонецОбласти
